{
    "reviews" : {

        "lost_ark_review": {

            "image": "../assets/lost-ark-2021.jpg",
            "title": "Lost Ark",
            "short_desc": "The Korean Diablo, No One Knew They Wanted..",
            "author": "Rado Radev",
            "date_of_publish": "13/06/2024",
            "playtime_of_publish": "223h",
            "rating": "7.5/10",
            "genre": "MMO, RPG",
            "developer": "Smilegate",
            "publisher": "Amazon Games",
            "platform": "PC",
            "release-date": "04/12/2019",
            "game_introduction": "Lost Ark - FTP, action, combat, asymmetrical, MMORPG - released December 2019 in the South Korean region only, and later officially released with servers in Europe, North and South America. Developed and published by Smilegate and Tripod Studio - known for making games like: CrossFire series, SoulWorker, etc. I found out about the game 2-3 weeks before it was released in our region and was eagerly waiting for it, watching streams and videos that constantly talked about 'how good it is', how it's a 'revolution in the genre', the game that has content for every kind of player - be it a PVP fanatic, a Dungeon/Raid hardcore lover, a game-content collector and so on. These were the main popular opinions from players who have been able to play the game so far. The gaming market, or perhaps more accurately the MMORPG market was badly in need of a sip of water, from how dried up it had become. The hype around this genre hasn't been the same for a long time. Things weren't going well with most MMOs, from how hard it is to actually sustain a game like this, financially, game-wise and keeping it in the marquee, with most eyes cast on the other big fish in the ocean. Due to the empty market, die-hard MMO players are turning their attention to new releases. Final Fantasy XIV, even after its poor start, has gained huge popularity the last 2 years. The long awaited Elden Ring, despite not so much dropping by MMOs, reached the top 3 on Steam for number of players the day after release. Despite New World's dropped playerbase today, on the day of its release it reached 900k players. And Lost Ark? 1.3 million as of launch day. Absolute stagnation to this day with a playercount of 600-700 thousand per day. A month after release and in the western market it never stops attracting attention. Streamer's like Asmongold, Savix, Towelliee broadcast their gameplay daily playing the game and only the game.",
            "gameplay": "When creating a character, the game presents you with 5 classes: Warrior, Mage, Martial Artist, Gunner and Assassin - each of which is broken down into a 'subclass' that actually defines your play style. Like most Asian MMOs, there are gender-locked subclasses and even classes, i.e. if you want to be an Artillerist (Gunner subclass), you have to be male, if you want to be a Wardancer (Martial Artist subclass) - female, or even if you want to be any subclass of Warrior, you have to be male. This kind of character creation is looked down upon by the western 'progressive' market and was the first red flag for them. But tbh, for me as long as there is a lore reason why the classes are assigned like that, there is no problem. I'd say that's the charm of 'Theme park' RPG's. From there on, the actual character creation is actually pretty good, for an asymmetrical game. But the fact that it's Korean and from 2019 clearly explains why. Black Desert Online is the first I can think of now for such a character creation - again, Korean and relatively new to the market. The star of the show. The thing that screams Lost Ark is the in-game combat. It comes very close to Diablo in how satisfying it is and manages to hold you 'for another 5 minutes'. The skills themselves are visually luscious. Especially the Awakening abilities (specific abilities that are unlocked at the end through special quests) with their fierce animations and big numbers. Even though I only have one Artillerist as a character, I can see that they've managed to make each class as different as they are the same from each other. This is the first MMO that doesn't play by 'The holy trinity' rule of class design - Tank/Healer/DPS. While there are tank (Paladin) and healer (Bard) classes, they aren't shy about bringing out the big numbers on your screen. Especially with the game's combat, the developers have done well. And is probably one of the big selling points in the game for everyone.The max level in Lost Ark is 60. Up until level 50 in the game, which is called by players the 'soft leveling cap' because it digests quickly, the main thing you'll be going through in this part of the game is the story, learning the intricacies around your class, and basic tutorial's that are scattered in incremental quests as you dig through the levels.",
            "story": "It's not some masterpiece like the lore of World of Warcraft (before Warlords of Draenor), or the Elder Scrolls, but it's happening. There's the thing that I stopped reading the quests after level 30 maybe, and I didn't get that far into figuring out what was actually going on with the game's lore, but I'd say if you don't skip the cinematic's and have an IQ over 10, you'll get a feel for the world of Lost Ark. Long story short: Legions of demons commanded by 6 generals attack the world Arkesia for the second time and we, as the main character in the story, are chosen to find and assemble the 7 parts of a special artifact 'The Ark' that states it has the power to create and destroy anything. And in search of it, we travel through the different continents of Arkesia, unraveling various problems, such as slavery in Shushire, corruption in Luttera, etc.",
            "final_thoughts": "For a free MMORPG my expectations were more than questionable, but the marketing and good reviews of people who had gotten the game before others managed to pique my interest. And even now with my mere 70+ hours in the game, I'd say they were fun-filled. The dungeons and raids are fun, interactive and really test your skills and reactions. The content is enough for maybe 1000+ hours. Even at the time of writing this review there is talk of a new major update for the game, talking even more content. I haven't tried the PVP yet, but I've also heard good reviews that I plan to trust. Overall the game is fun and I think a must try for any MMORPG player, mainly because of its optional casually chilling playstyle ."
        },
        "dead_by_daylight_review": {

            "image": "../assets/dbd.jpg",
            "title": "Dead by Daylight",
            "short_desc": "In the Killer's Shoes",
            "author": "Rado Radev",
            "date_of_publish": "14/06/2024",
            "playtime_of_publish": "170h",
            "rating": "8/10",
            "genre": "Horror, Multiplayer",
            "developer": "Behaviour Interactive, 505 Games",
            "publisher": "Behaviour Interactive, 505 Games, Deep Silver, NetEase Games, Starbreeze Studios",
            "platform": "PC, PS5, PS4, Nintendo Switch, etc.",
            "release_date": "14/06/2016",
            "game_introduction": "Dead by Daylight - asymmetrical, hack and slash, horror, multiplayer (4v1), released June 2016 for PC, June 2017 for XBOX and PS4 and later for other platforms. Published by Behaviour Interactive Inc. - known for their partnership contributions to other companies in making games such as Rainbow Six, Call of Duty: Vanguard, Borderlands: The Pre-Sequel, etc. The first time I heard about the game was when it came out for free in the Epic Games launcher, so early December 2021. After a brief look at the screenshots, the short description and the good reviews of 2-3 friends, I knew it would be a game just to get a group of friends together and have some fun. It didn't seem like the typical tryhard games of today.",
            "gameplay": "The gameplay is divided into 2 parts - killer and survivor. The killer has to kill the survivors before they escape from him, working together in fixing the 5 generators fueling the 2 doors on the map they are escaping from. The survivors can use the terrain on the map (pallets, windows, etc) to evade, lure, and stun the killer, and in return they run away from him more slowly. They are also allowed to use 1 of 5 basic items (lantern, toolbox, first aid kit, map, and key), and if they haven't gotten one since the beginning of the game, they can get one from randomly scattered small crates around the map. While fixing generators, skill-checks can come out, which are like little minigame reflexes. If not executed correctly, the generator's progress is reduced by a few percent and it thunders itself, usually attracting the attention of the assassin (90% of the time I'm guilty of this). After repairing the 5 generators, the escape doors are fed and when they open after pulling the handle next to them, the survivors can escape successfully. The assassin, besides the weapon he is equipped with, comes with one or two skills, such as - throwing knives, splitting the ground, invisibility, teleportation, etc., each of which comes with a disadvantage - slowing your escape, getting tired, stunning, etc.  They can also manipulate the terrain by - breaking the pallets dropped by the survivors, breaking specific doors, jumping over windows and so on, but this makes them slow down while chasing their prey. The actual killing of a survivor is done by hitting them 2 times and knocking them to the ground. The killer picks up the body and hangs it on one of the hooks scattered around the map, and they can unhook them (riskier) or wait for one of the others to help them. The survivor is killed after the 3rd time they are hooked or until their time runs out while they are hooked. Yet another method of escape for survivors is via a pit that appears randomly on the map when only one person remains. If it is found by the killer before them, they can close it and automatically feed the doors if they are not already fed, giving the survivor one more remaining chance. Upon closing the shaft or opening one of the doors, a timer is started, which upon its expiration, any survivor if they don't escape in time is killed by 'The Entity' (which I'll talk about later). Both teams are given ancillary bonuses before the start of the game in the form of 'perk' and 'offering'. Perk's give bonuses like - dash, sprint, seeing a survivor/killer's aura, etc, and Offering's give card manipulation like - more spaced hooks, more chests, your specific card choice, etc. Item's, perk's and offering's are picked up from the network store via 'bloodpoints' which are picked up after each game.",
            "story": "The story of the game itself is told not so much in gameplay, but in various external resources such as item descriptions, official cinemagraphs of the game, collecting in-game tomes by completing missions, and most of all directly from the Story tab of a selected character - each with their own unique story. The cool thing is that they manage to tie each character into a dimension very well in a very simple way - the power of 'The Entity'. 'The Entity - is an omnipotent malevolent being that travels the cosmos and slowly devours worlds. It creates nightmarish interdimensional realities such as 'Testing Fields' to ensnare its victims, survivors, and assassins in an endless cycle of 'Trials' with the intent of feeding on their strongest emotions, allowing it to increase its power and slowly devour another world.' It itself serves as a means of uniting the existence of different killers and survivors from different realities into one. The game combines both characters of its own creation and characters from other world-famous films such as Michael Myers (Halloween), Freddy Krueger (Nightmare on Elm's Street) and Sadako Yamamura (The Ring).",
            "final_thoughts": "The well-crafted visual and aural atmosphere on both ends (survivalist and assassin), the as complex as it is easy gameplay, and the constant editing and adding new things to the story that gives it more and more depth, gives the game a tremendous amount of replayability and a thirst for following its progress in the future. Minuses that I noticed in my 100+ hours of play, however, were mainly exploiting specific character perk's, as well as irritating and hurting the playerbase mentality ways of playing both sides. Assassins for example could just hang a guy on a hook, waiting in front of him for anyone who would save him. By leaving him in place, the survivors can't touch him, and the person hanging on the hook has to play the 3% chance of getting off the hook, or else he's left to die. Also, the game is known for its ever-so-liked hacks, which aren't as common anymore, but I keep getting a YouTube video every 2-3 days of watching some flying or teleporting idiot get caught by a streamer. Even if you're not a fan of the horror genre, this is a game you should definitely try, but definitely with friends for more fun and cool moments."
        },
        "age_of_empires_2_review": {

            "image": "../assets/aoe2de.jpg",
            "title": "Age of Empires 2: Definitive Edition",
            "short_desc": "A Historic Classic",
            "author": "Rado Radev",
            "date_of_publish": "14/06/2024",
            "playtime_of_publish": "80h",
            "rating": "10/10",
            "genre": "RTS",
            "developer": "Ensemble Studios",
            "publisher": "Microsoft",
            "platform": "PC, XBox One, XBox X and S series",
            "release_date": "Initial - 27/09/1999 | DE - 14/11/2019",
            "game_introduction": "Age of Empires II - Single/Multi player, Historical, RTS - released 1999 for PC and Mac. Developed by Ensemble Studios - responsible for creating the entire AOE series to date (except Age of Empires IV), as well as Halo Wars (RTS again) - and published by Microsoft. The game goes with multiple expansions, with 2013's game being updated to Age of Empires II: HD, freeing it from the limited screen resolution, and 2019's Age of Empires II: Definitive Edition absolutely changed and upgraded: graphics, UI, home screen, and heaps of quality of life changes - like easier grouping of units and structures, and so on. Just as World of Warcraft was until recently considered the king of MMOs, AOE II is the star of the RTS sphere and very few people can complain about it.",
            "gameplay": "Since the game is one of the earliest kind of RTS games, it along with others like Starcraft and Warcraft set the standard for how gameplay should be played - gathering resources, building a base with them, creating an army, managing the economy, etc. The game launches with 3 villagers and a central structure called Town Center. The goal is to grow into a large empire just from what you are given. The villagers are the main unit in the game, and its function is to develop your economy as well as construct buildings. There are 4 types of resources - food, wood, gold and stones, and each villager can work to collect from any of these at any time. The game is divided into ages - Dark Age, Feudal Age, Castle Age and Imperial Age, with each successive age unlocking more structures, technologies (bonuses) and units (peasant or military units). Ages are unlocked after certain requirements from structures built in the last age and a certain number of resources. Then, when selecting the button for the next epoch, time is waited until it 'learns'. In exactly the same way, without the structures part, learning new technologies and producing units happens. The different facts, or in this case civilizations, are 39 in number, giving you the chance to play with peoples from the Middle Ages such as Franks, Goths, Incas, Chinese and even Bulgarians. Each differs with different unique technologies, units, structures and bonuses, and restrictions to them. The situation gets even more in-depth when you find out that there are also hidden bonuses, giving more nuance on the combat in the game. For example - each military unit has its own counter and corresponding advantage against another, giving the feeling of playing rock, paper, scissors. A spear unit will beat more on a mounted unit, which in turn will beat more on a shooting unit, which in turn will beat ... you get the idea. And one more - if 2 units fight on a hill, the one hitting from higher on the corresponding hill will hit more dmg, the one below it, less. There are summat examples like these, you're the one who will just have to hunt them down and figure them out. There is also the presence of game mods changing the start of the game, and/or ways of playing.",
            "story": "The game has a medieval-historical theme, following events throughout our millennial history. In addition to multiplayer or against bots, the game has built-in multiple campaigns, each several chapters long, walking in the footsteps of our great kings, kings, emperors, etc. For Bulgaria, the developers have chosen the story of the life of our all-famous Ivaylo - his rise from simple peasant to 'King of the Bulgarians', his many battles with the Byzantines and Tatars who attacked us at the time and his dealing with the corrupt boyars within society.",
            "final_thoughts": "For a game that came out 2 decades ago, it manages to stay on the market with its worthy rank as the 'Best RTS Game' ever made. It manages to support 15-20 thousand people daily, with a minimum of a minute or two wait for multiplayer. But even if you don't want to play against other people, or aren't brave enough to go up against them, the large selection of campaigns and options for facing off against bots give countless hours of play considering all the map options, game-mods, scenarios and so on. A must buy if you're a fan of the RTS genre, or if you want to dip your toe in that water and don't know which game to start with."
        },
        "elden_ring_review": {
            "image": "../assets/elden_ring.jpg",
            "title": "Elden Ring",
            "short_desc": "A Masterpiece in Open-World Design",
            "author": "Rado Radev",
            "date_of_publish": "19.06.2024",
            "playtime_of_publish": "90h",
            "rating": "9.5/10",
            "genre": "RPG, Action, Adventure",
            "developer": "FromSoftware",
            "publisher": "FromSoftware, BandaiNamco",
            "platform": "PC, PS4, PS5, XBoxONE, XBox X and S series",
            "release_date": "25/02/2022",
            "game_introduction": "Elden Ring, developed by FromSoftware and published by Bandai Namco Entertainment, is an action RPG set in a sprawling, dark fantasy world. Released in February 2022, this game is the brainchild of Hidetaka Miyazaki, the visionary behind the Dark Souls series, and George R.R. Martin, the author of A Song of Ice and Fire. With such a powerhouse duo at its helm, Elden Ring was eagerly anticipated by fans of challenging gameplay and intricate world-building. From the moment it was announced, Elden Ring promised an expansive open-world experience infused with the brutal combat mechanics that FromSoftware is renowned for.",
            "gameplay": "Elden Ring's gameplay is a masterful blend of the familiar and the innovative. The game retains the challenging combat mechanics of its predecessors, demanding precise timing, strategic planning, and a deep understanding of enemy patterns. Players can choose from various classes, each with unique abilities and playstyles, and can further customize their character through a vast array of weapons, spells, and items. The open world of Elden Ring, known as the Lands Between, is divided into six distinct regions, each ruled by a demigod. These regions are filled with dungeons, fortresses, and towering structures that invite exploration. Unlike the linear progression of previous FromSoftware titles, Elden Ring allows players to explore its world at their own pace, discovering hidden secrets and formidable foes around every corner. One of the standout features of Elden Ring is its day-night cycle and dynamic weather system, which affect both gameplay and the world's aesthetics. Enemies and NPCs may behave differently depending on the time of day, adding another layer of depth to the game.",
            "story": "The narrative of Elden Ring is rich and complex, weaving a tale of shattered order and the quest to restore the Elden Ring and become the Elden Lord. The story is delivered through cryptic dialogue, item descriptions, and environmental storytelling, a signature approach of FromSoftware that encourages players to piece together the lore themselves. The collaboration with George R.R. Martin is evident in the game's intricate backstory and world-building. Each region's demigod ruler has a unique history and relationship with the Elden Ring, and the player's journey to defeat them and claim their power is filled with twists and revelations. The lore is deep, with each discovery adding to the player's understanding of the Lands Between and its troubled history.",
            "final_thoughts": "Elden Ring is a triumph of game design, offering a vast, open world filled with secrets to uncover and challenges to overcome. Its combination of deep lore, intricate gameplay, and stunning visuals makes it a must-play for fans of action RPGs and dark fantasy. While the game's difficulty may be daunting for some, the sense of accomplishment that comes from mastering its challenges is immensely rewarding. However, like any game, Elden Ring is not without its flaws. Some players may find certain mechanics or bosses frustrating, and the game's demanding nature might not appeal to everyone. Additionally, the open-world format can sometimes lead to moments of aimlessness, though these are rare. Overall, Elden Ring is a masterful addition to FromSoftware's legacy, pushing the boundaries of what an open-world action RPG can be. Whether you are a longtime fan of Miyazaki's work or new to the genre, Elden Ring offers an unforgettable adventure that is well worth your time."
        },
        "god_of_war_review": {
            "image": "../assets/gow_ragnarok.jpg",
            "title": "God of War: Ragnarok",
            "short_desc": "A Sequel Worthy of the Gods",
            "author": "Rado Radev",
            "date_of_publish": "20.03.2024",
            "playtime_of_publish": "115h",
            "rating": "8/10",
            "genre": "RPG, Action, Adventure",
            "developer": "Santa Monica Studio, Jetpack Interactive",
            "publisher": "Sony Interactive Entertainment, Playstation Studios",
            "platform": "PC, PS4, PS5",
            "release_date": "09/11/2022",
            "game_introduction": "God of War: Ragnarok, developed by Santa Monica Studio and published by Sony Interactive Entertainment, is the highly anticipated sequel to the critically acclaimed God of War (2018). Released in November 2022, this action-adventure game continues the story of Kratos and his son Atreus as they navigate the treacherous world of Norse mythology. Building on the success of its predecessor, Ragnarok promises an epic journey filled with intense combat, rich storytelling, and profound character development.",
            "gameplay": "God of War: Ragnarok refines and expands upon the gameplay mechanics introduced in the 2018 reboot. The combat system remains visceral and satisfying, combining Kratos's brutal melee attacks with Atreus's ranged support. Players can wield the Leviathan Axe and the Blades of Chaos, each with unique abilities and upgrade paths. The game introduces new weapons and combat techniques, providing fresh strategies for dealing with a variety of enemies. One of the significant gameplay improvements in Ragnarok is the expanded role of Atreus. Now older and more capable, Atreus plays a more active part in combat and puzzle-solving. His abilities and skills can be upgraded, allowing for more dynamic interactions between the father-son duo. The synergy between Kratos and Atreus is central to the gameplay, emphasizing teamwork and strategy. The world of Ragnarok is larger and more diverse than before, featuring new realms to explore and a greater variety of enemies. The game includes a mix of linear story missions and open-world exploration, with numerous side quests and optional activities that add depth to the experience. Puzzle-solving elements are more intricate, requiring players to think creatively and use both characters' abilities to progress.",
            "story": "The story of God of War: Ragnarok is a compelling continuation of Kratos and Atreus's journey. Set in the aftermath of the events of the previous game, Ragnarok explores themes of destiny, family, and the consequences of one's actions. The narrative is deeply rooted in Norse mythology, weaving together mythological events and characters in a way that feels both epic and personal. As Ragnarok approaches, Kratos and Atreus must contend with the looming threat of the Norse gods, including Thor and Odin. The story delves into Atreus's quest to uncover his true identity and understand his role in the impending apocalypse. Kratos, on the other hand, grapples with his past and strives to protect his son from the dangers that lie ahead. Character development is a standout aspect of the story. The relationship between Kratos and Atreus evolves, showcasing their growing bond and the challenges they face as they navigate their complex world. Supporting characters from the previous game return, along with new faces that add depth and intrigue to the story. The game's narrative is emotionally charged, with moments of triumph, loss, and revelation that keep players engaged from start to finish.",
            "final_thoughts": "God of War: Ragnarok is a masterful blend of engaging gameplay and powerful storytelling. It builds on the strengths of its predecessor, offering refined combat mechanics, deeper character interactions, and a richly detailed world. The balance between action and narrative ensures that players are constantly invested in the journey of Kratos and Atreus. However, the game is not without its challenges. Some players might find the increased complexity of puzzles and combat mechanics demanding, and the dense lore of Norse mythology can be overwhelming for those new to the series. Additionally, the linear nature of the main story might limit the sense of freedom found in other open-world games. Overall, God of War: Ragnarok is a worthy successor to the 2018 game, delivering an epic adventure that is both thrilling and emotionally resonant. Whether you are a longtime fan or new to the series, Ragnarok offers an unforgettable experience that stands as a testament to the storytelling and gameplay prowess of Santa Monica Studio."
        },
        "resident_evil_review": {
            "image": "../assets/resident_evil_village.jpg",
            "title": "Resident Evil Village",
            "short_desc": "Horror at its Finest",
            "author": "Rado Radev",
            "date_of_publish": "02/04/2024",
            "playtime_of_publish": "112h",
            "rating": "7/10",
            "genre": "Horror, Adventure",
            "developer": "Capcom",
            "publisher": "Capcom",
            "platform": "PC, PS4, PS5, Nintendo Switch, XBoxONE, XBox X and S series",
            "release_date": "07/05/2021",
            "game_introduction": "Resident Evil Village, developed and published by Capcom, is the eighth main installment in the iconic survival horror series. Released in May 2021, this game follows the story of Ethan Winters, the protagonist of Resident Evil 7: Biohazard, as he ventures into a mysterious village to rescue his kidnapped daughter. The game combines classic survival horror elements with action-packed gameplay, delivering a chilling and immersive experience that both honors and evolves the series' legacy.",
            "gameplay": "Resident Evil Village offers a balanced blend of survival horror and action. The game is played from a first-person perspective, enhancing the sense of immersion and terror. Players must manage resources carefully, scavenging for ammo, health items, and crafting materials while fending off a variety of grotesque enemies. Combat in Village is intense and varied. Players face off against werewolf-like creatures, vampiric foes, and other nightmarish beings. The game provides a range of weapons, from pistols and shotguns to more powerful firearms, each of which can be upgraded using in-game currency. The introduction of a merchant character, the Duke, allows players to buy and sell items, making resource management a crucial part of the gameplay. Exploration is a key component, with the village serving as a hub that connects different areas, each with its own unique challenges and secrets. Puzzles are interspersed throughout the game, requiring players to think critically and often backtrack to previous locations with new items or information. The game's pacing keeps players on edge, alternating between intense combat sequences and moments of eerie calm.",
            "story": "The narrative of Resident Evil Village continues the story of Ethan Winters, who embarks on a desperate mission to rescue his daughter, Rose, from a sinister cult led by Mother Miranda. The story delves deeper into the lore of the Resident Evil universe, uncovering connections to previous games and expanding on the bioweapon themes that have been central to the series. The village and its inhabitants are richly detailed, with each major antagonist—referred to as the Four Lords—having distinct personalities and backstories. These characters, including the instantly iconic Lady Dimitrescu, add depth and variety to the game's plot. As Ethan uncovers the dark secrets of the village, he encounters a series of shocking revelations and intense confrontations that drive the story forward. The game's narrative is delivered through a mix of cutscenes, environmental storytelling, and documents scattered throughout the village. This approach keeps players engaged, encouraging exploration and rewarding those who seek to uncover every piece of the puzzle. The story builds to a climactic and emotionally charged conclusion, setting the stage for future installments in the series.",
            "final_thoughts": "Resident Evil Village is a masterclass in blending horror and action. It pays homage to the series' roots while introducing new elements that keep the gameplay fresh and exciting. The combination of intense combat, resource management, and exploration creates a compelling and immersive experience. However, some players might find the shift towards a more action-oriented approach less frightening than previous entries. Additionally, the game's narrative, while engaging, relies heavily on prior knowledge of the series, which might be challenging for newcomers. Overall, Resident Evil Village stands out as a worthy addition to the Resident Evil franchise, delivering a thrilling and memorable horror experience that will satisfy both longtime fans and newcomers to the series."
        },
        "final_fantasy_review": {
            "image": "../assets/ffxiv.jpg",
            "title": "Final Fantasy XIV: Endwalker",
            "short_desc": "The Ultimate Expansion",
            "author": "Rado Radev",
            "date_of_publish": "23/01/2024",
            "playtime_of_publish": "216h",
            "rating": "9.5/10",
            "genre": "MMO, RPG",
            "developer": "Square Enix",
            "publisher": "Square Enix",
            "platform": "PC, PS5, PS4, XBox X and S series",
            "release_date": "03/12/2021",
            "game_introduction": "Final Fantasy XIV: Endwalker, developed and published by Square Enix, is the latest expansion for the acclaimed MMORPG Final Fantasy XIV. Released in December 2021, Endwalker brings a grand conclusion to the saga of Hydaelyn and Zodiark, promising an epic narrative, new jobs, and a host of new content. Building on the success of its predecessors, Endwalker aims to elevate the already beloved game to new heights.",
            "gameplay": "Endwalker introduces significant gameplay enhancements and new content, further enriching the Final Fantasy XIV experience. The expansion adds two new jobs: the Sage, a healer class that utilizes barriers and advanced magicks, and the Reaper, a melee DPS class that wields a scythe and summons a spectral avatar. These new jobs bring fresh dynamics to the gameplay, offering players new ways to engage in combat and support their parties. The level cap is increased to 90, providing players with new abilities and skills to master. The expansion also introduces new dungeons, trials, and raids, each meticulously designed with unique mechanics and challenging encounters. The addition of new zones, including the moon and the ancient city of Old Sharlayan, expands the game's world, offering breathtaking landscapes and rich lore to explore. One of the standout features of Endwalker is the enhancement of the game's crafting and gathering systems. New recipes, materials, and mechanics ensure that crafters and gatherers have plenty to engage with, supporting the game's vibrant player-driven economy. The expansion also brings quality-of-life improvements, including updates to the user interface and the addition of new housing options.",
            "story": "The narrative of Endwalker is a grand and emotional finale to the long-running story arcs that have captivated players for years. It follows the Warrior of Light and their allies as they confront the looming threat of the Final Days, a cataclysmic event that threatens to destroy all life. The story delves deep into the lore of Hydaelyn and Zodiark, revealing secrets and answering questions that have lingered since the game's inception. Endwalker's story is filled with memorable characters, both new and returning. The expansion explores the motivations and backstories of key figures, providing a rich and immersive narrative experience. The emotional depth of the story, combined with high-stakes conflicts and epic moments, ensures that players are constantly engaged and invested in the outcome. The narrative is delivered through beautifully rendered cutscenes, in-game dialogue, and quests that weave together seamlessly. The expansion's story is both a culmination of long-running plotlines and a stepping stone to new adventures, leaving players excited for the future of Final Fantasy XIV.",
            "final_thoughts": "Final Fantasy XIV: Endwalker is a triumph of storytelling and gameplay design. It successfully brings a satisfying conclusion to major story arcs while introducing new content and mechanics that enhance the overall experience. The new jobs, expanded zones, and improved systems ensure that players have plenty to explore and enjoy. However, the sheer amount of content and the complexity of the narrative may be overwhelming for new players. The game's reliance on previous expansions' storylines means that those unfamiliar with the lore might find it challenging to fully appreciate the depth of Endwalker's narrative. Overall, Endwalker is a must-play for fans of Final Fantasy XIV, delivering an epic and emotionally resonant adventure that cements the game's status as one of the greatest MMORPGs of all time."
        },
        "hogwarts_legacy_review": {
            "image": "../assets/hogwarts_legacy.jpg",
            "title": "Hogwarts Legacy",
            "short_desc": "Magic Unleashed",
            "author": "Rado Radev",
            "date_of_publish": "28/06/2024",
            "playtime_of_publish": "198h",
            "rating": "8/10",
            "genre": "RPG, Action, Adventure",
            "developer": "Avalanche Software, Shiver Entertainment",
            "publisher": "Warner Bros. Games",
            "platform": "PC, PS4, PS5, Nintendo Switch, XBoxONE, XBox X and S series",
            "release_date": "10/02/2023",
            "game_introduction": "Hogwarts Legacy, developed by Portkey Games and published by Warner Bros. Interactive Entertainment, is an action RPG set in the Harry Potter universe. Released in February 2023, this game invites players to experience life as a student at the iconic Hogwarts School of Witchcraft and Wizardry. Set in the 1800s, long before the events of the Harry Potter books, Hogwarts Legacy offers a fresh perspective on the magical world, filled with exploration, spellcasting, and adventure.",
            "gameplay": "Hogwarts Legacy offers an immersive and interactive experience, allowing players to live out their fantasies of attending Hogwarts. The game features a robust character creation system, enabling players to customize their witch or wizard and choose their Hogwarts house. As students, players attend classes, learn spells, brew potions, and interact with other students and professors. The open-world design of Hogwarts Legacy encourages exploration. Players can roam freely around the castle, visit familiar locations like the Forbidden Forest and Hogsmeade Village, and discover hidden secrets throughout the school grounds. The game includes a variety of side quests and activities, ensuring that there is always something to do. Combat in Hogwarts Legacy is dynamic and strategic. Players use a combination of spells, potions, and magical creatures to defeat enemies. The spellcasting system allows for a range of offensive and defensive spells, and players can experiment with different combinations to suit their playstyle. As they progress, players can unlock new abilities and upgrade their magical arsenal.",
            "story": "The story of Hogwarts Legacy is an original tale set in the rich lore of the Harry Potter universe. Players take on the role of a fifth-year student who possesses a unique ability to harness ancient magic. This mysterious power attracts the attention of both allies and adversaries, setting off a chain of events that could alter the course of magical history. The narrative is filled with intrigue, mystery, and adventure. Players uncover hidden truths about the wizarding world, encounter dark forces, and make choices that influence the outcome of the story. The game features a diverse cast of characters, each with their own stories and motivations, adding depth to the overall narrative. The story is delivered through engaging quests, character interactions, and beautifully crafted cutscenes. The game's setting in the 1800s allows for new and unique perspectives on the magical world, providing fresh experiences even for long-time fans of the Harry Potter series.",
            "final_thoughts": "Hogwarts Legacy is a dream come true for fans of the Harry Potter universe. Its combination of immersive gameplay, rich storytelling, and detailed world-building creates a magical experience that is both nostalgic and new. The game captures the essence of what makes the Harry Potter series beloved while introducing innovative gameplay mechanics and a compelling original story. However, some players might find the pacing of the game slow, especially during the early stages of attending classes and learning spells. Additionally, while the open-world design is impressive, it can sometimes lead to moments of aimlessness. Overall, Hogwarts Legacy is a captivating and enchanting RPG that offers a unique and immersive journey into the wizarding world. It's a must-play for fans of the series and a delightful adventure for newcomers alike."
        },
        "cyberpunk_2077_review": {
            "image": "../assets/cyberpunk_2077.jpg",
            "title": "Cyberpunk 2077",
            "short_desc": "Redemption Through Patches",
            "author": "Rado Radev",
            "date_of_publish": "22/06/2024",
            "playtime_of_publish": "102h",
            "rating": "6.5/10",
            "genre": "Action, Adventure",
            "developer": "CD Projekt RED",
            "publisher": "CD Projekt RED",
            "platform": "PC, PS4, PS5, XBoxONE, XBox X and S series",
            "release_date": "10/12/2020",
            "game_introduction": "Cyberpunk 2077, developed and published by CD Projekt Red, is an open-world action RPG set in the dystopian future of Night City. Originally released in December 2020, the game faced significant criticism due to technical issues and performance problems. However, through a series of patches and updates, CD Projekt Red has worked to address these issues, aiming to deliver the ambitious experience they promised.",
            "gameplay": "Cyberpunk 2077 offers a sprawling and immersive open-world experience. Players assume the role of V, a mercenary with customizable cyberware and abilities. The game features a robust character creation system, allowing players to choose V's appearance, background, and skillset. The gameplay combines first-person shooting, hacking, and RPG elements, providing multiple ways to approach missions and challenges. Night City is a vibrant and detailed world, filled with diverse districts, dynamic characters, and countless activities. Players can explore the city, engage in side quests, and interact with its inhabitants. The game offers a branching narrative with multiple endings, influenced by the player's choices and actions. Combat in Cyberpunk 2077 is intense and varied. Players can use an array of weapons, from firearms to melee weapons, and utilize cybernetic enhancements to gain an edge in battle. The game also features a comprehensive crafting system, allowing players to modify and upgrade their gear. Stealth and hacking provide alternative approaches to combat, enabling players to take down enemies and complete objectives without direct confrontation.",
            "story": "The story of Cyberpunk 2077 follows V as they navigate the dangerous and complex world of Night City. The main plot revolves around a heist gone wrong, leading to V becoming entangled with the digital ghost of Johnny Silverhand, a rebellious rockstar played by Keanu Reeves. The narrative explores themes of identity, corruption, and the human condition, providing a deep and engaging experience. The game's story is driven by well-developed characters and intricate plotlines. Players build relationships with various NPCs, each with their own stories and quests. These interactions and choices significantly impact the narrative, leading to multiple possible outcomes. The story is delivered through cinematic cutscenes, in-game dialogue, and environmental storytelling, creating a rich and immersive experience.",
            "final_thoughts": "Cyberpunk 2077, despite its rocky launch, has evolved into a compelling and ambitious RPG. The combination of immersive gameplay, detailed world-building, and a complex narrative provides a unique experience that stands out in the genre. The post-launch updates and patches have addressed many of the initial technical issues, making the game more stable and enjoyable. However, some players might still encounter occasional bugs and performance issues, particularly on older hardware. Additionally, the game’s ambitious scope can sometimes lead to uneven pacing and occasional narrative inconsistencies. Overall, Cyberpunk 2077 is a testament to the resilience of both the developers and the player community. It offers a rich and immersive experience that, despite its flaws, delivers on its promise of a sprawling and engaging cyberpunk adventure."
        },
        "the_witcher_review": {
            "image": "../assets/the_witcher_3.jpg",
            "title": "The Witcher 3",
            "short_desc": "Next-Gen Upgrade",
            "author": "Rado Radev",
            "date_of_publish": "10/06/2024",
            "playtime_of_publish": "350h",
            "rating": "8.5/10",
            "genre": "RPG, Action, Adventure",
            "developer": "CD Projekt Red",
            "publisher": "CD Projekt",
            "platform": "PC, PS4, PS5, XBoxONE, XBox X and S series",
            "release_date": "19/05/2015",
            "game_introduction": "The Witcher 3: Wild Hunt, developed by CD Projekt Red and originally released in May 2015, is an action RPG set in a dark fantasy world. The game received a next-gen upgrade in December 2022, enhancing its visuals, performance, and adding new content. Players control Geralt of Rivia, a monster hunter known as a Witcher, as he embarks on a quest to find his adopted daughter, Ciri, while navigating a world filled with political intrigue and supernatural threats.",
            "gameplay": "The Witcher 3: Wild Hunt offers a vast open-world experience, filled with detailed environments, dynamic weather, and a day-night cycle. The game features a rich narrative and branching storylines, influenced by player choices and actions. Players engage in combat using swords, magic (known as Signs), and alchemy, providing a variety of strategies to tackle enemies. Exploration is a key component, with the game world divided into several large regions, each with its own unique atmosphere and challenges. Players can undertake a plethora of side quests, contracts, and activities, each with its own story and rewards. The next-gen upgrade enhances the game's graphics, adding ray tracing, improved textures, and faster load times, making the world even more immersive. The game's crafting and alchemy systems are robust, allowing players to create potions, bombs, and gear. Upgrading Geralt’s abilities through skill trees provides customization options to suit different playstyles. The inclusion of new content in the next-gen update, such as additional quests and items inspired by the Netflix series, adds further depth and replayability.",
            "story": "The story of The Witcher 3: Wild Hunt is a masterclass in narrative design. Geralt's quest to find Ciri is deeply personal, intertwined with larger political and supernatural events. The game's main story is complemented by numerous side quests that are often as compelling as the main plot. The characters are well-developed, each with their own motivations and arcs, making the world feel alive and believable. The narrative explores themes of destiny, family, and morality, often presenting players with difficult choices that have significant consequences. The dialogue is sharp and well-written, delivered by a talented voice cast that brings the characters to life. The game's lore is rich and detailed, drawn from the books by Andrzej Sapkowski, and the narrative is presented through a combination of cutscenes, in-game interactions, and environmental storytelling.",
            "final_thoughts": "The Witcher 3: Wild Hunt remains one of the greatest RPGs of all time, and the next-gen upgrade ensures it continues to shine for new and returning players. The combination of immersive gameplay, a richly detailed world, and a compelling narrative creates an experience that is both epic and intimate. However, the game's complexity and depth might be overwhelming for some players, particularly those new to the series. The next-gen update, while improving many aspects, does not fundamentally change the core gameplay, which may feel dated to some. Overall, The Witcher 3: Wild Hunt is a must-play for fans of the genre, offering a rich and rewarding adventure that stands the test of time."
        },
        "assassins_creed_review": {
            "image": "../assets/assassins_creed.jpg",
            "title": "Assassin's Creed: Valhalla",
            "short_desc": "Dawn of Ragnarok",
            "author": "Rado Radev",
            "date_of_publish": "29/05/2024",
            "playtime_of_publish": "60h",
            "rating": "6.5/10",
            "genre": "Action, Adventure",
            "developer": "Ubisoft Montreal",
            "publisher": "Ubisoft",
            "platform": "PC, PS4, PS5, XBoxONE, XBox X and S series",
            "release_date": "10/09/2020",
            "game_introduction": "Assassin's Creed Valhalla, developed by Ubisoft and released in November 2020, is an action-adventure game set during the Viking invasion of England. Players control Eivor, a Viking raider, as they lead their clan from the harsh shores of Norway to the lush but hostile lands of England. The game combines the series' signature parkour and stealth mechanics with brutal combat and a deep narrative, offering a rich and expansive open-world experience.",
            "gameplay": "Assassin's Creed Valhalla builds on the RPG elements introduced in previous entries, offering a vast and detailed world to explore. Players can customize Eivor's appearance, skills, and gear, allowing for a personalized playstyle. The game features a robust combat system, with a variety of weapons and abilities that can be upgraded through skill trees. Combat is visceral and satisfying, combining melee attacks, ranged options, and stealth takedowns. Exploration is a key aspect, with England divided into several regions, each with its own unique challenges and secrets. Players can engage in a variety of activities, including raiding monasteries, building and upgrading their settlement, and participating in various side quests and world events. The game also introduces a new mechanic called “Flyting,” a Viking rap battle, adding a unique and entertaining element to interactions. The Dawn of Ragnarok expansion further enriches the gameplay, introducing new abilities and content inspired by Norse mythology. Players can wield the power of the gods, enhancing their combat and exploration capabilities. The expansion adds new areas to explore and challenges to overcome, providing fresh content for veteran players.",
            "story": "The narrative of Assassin's Creed Valhalla follows Eivor's journey to establish a new home for their clan in England. The story is rich with historical and mythological elements, blending fact and fiction seamlessly. Eivor's personal quest is intertwined with the larger conflict between the Assassins and Templars, known in the game as the Hidden Ones and the Order of the Ancients. The game's story is delivered through well-crafted cutscenes, character interactions, and environmental storytelling. Players encounter a diverse cast of characters, each with their own motivations and story arcs. The choices players make throughout the game impact the narrative, leading to multiple possible outcomes. The Dawn of Ragnarok expansion delves deeper into Norse mythology, exploring the legends of Odin and the realms of the gods. This adds a layer of mythological depth to Eivor's story, providing a unique and fantastical experience that complements the historical setting.",
            "final_thoughts": "Assassin's Creed Valhalla is a robust and immersive addition to the series, offering a rich blend of historical and mythological storytelling. The combination of engaging combat, deep exploration, and a compelling narrative ensures that players remain invested throughout their journey. However, the game's sheer size and scope can be overwhelming, and some players might find the pacing slow at times. Additionally, the RPG elements, while well-implemented, may not appeal to those who prefer the more traditional stealth-focused gameplay of earlier entries. Overall, Assassin's Creed Valhalla is a must-play for fans of the series and those interested in Viking history and mythology. The Dawn of Ragnarok expansion adds even more depth and content, making it a worthy addition to the game."
        },
        "starfield_review": {
            "image": "../assets/starfield.jpg",
            "title": "Starfield",
            "short_desc": "Embark on an Interstellar Shitshow",
            "author": "Rado Radev",
            "date_of_publish": "19/05/2024",
            "playtime_of_publish": "40h",
            "rating": "4/10",
            "genre": "RPG, Adventure",
            "developer": "Bethesda Game Studios",
            "publisher": "Bethesda Softworks",
            "platform": "PC, XBox X and S series",
            "release_date": "06/09/2023",
            "game_introduction": "Starfield, developed by Bethesda Game Studios and published by Bethesda Softworks, is a highly anticipated RPG set in the vast expanse of space. Released in November 2023, the game marks Bethesda's first new universe in over 25 years. Starfield invites players to embark on an interstellar adventure, exploring distant planets, engaging in space combat, and uncovering the mysteries of the cosmos.",
            "gameplay": "Starfield offers a deep and immersive gameplay experience, characteristic of Bethesda's RPGs. Players create their own character, choosing from a variety of backgrounds and skills that influence their playstyle. The game features a vast open world, or rather, open galaxy, with numerous planets and star systems to explore. Each planet offers unique environments, resources, and challenges. Exploration is at the heart of Starfield. Players can pilot their own customizable spaceship, engage in space battles, and land on planets to explore on foot. The game's procedural generation ensures that no two planets are exactly alike, providing endless opportunities for discovery. The game also features a robust crafting and building system, allowing players to establish bases, mine resources, and craft equipment. Combat in Starfield is dynamic and varied. Players can engage in both space and ground combat, using a variety of weapons and abilities. The game's skill system allows for significant customization, enabling players to tailor their abilities to their preferred combat style. Whether engaging in dogfights in space or battling alien creatures on the ground, combat is a key component of the Starfield experience.",
            "story": "The narrative of Starfield is an epic space opera, filled with intrigue, mystery, and adventure. Players take on the role of a space explorer, uncovering ancient secrets and encountering various factions, each with their own goals and motivations. The story explores themes of exploration, humanity's place in the universe, and the quest for knowledge. The game's story is delivered through a mix of main quests, side quests, and environmental storytelling. Players' choices and actions influence the narrative, leading to multiple possible outcomes and encouraging replayability. The diverse cast of characters adds depth to the story, with each NPC offering unique perspectives and quests. The lore of Starfield is rich and detailed, with extensive background information available through in-game documents, conversations, and discoveries. The narrative is designed to be both expansive and personal, allowing players to immerse themselves fully in the universe of Starfield.",
            "final_thoughts": "Starfield is a groundbreaking RPG that delivers on its promise of an epic space adventure. The combination of deep exploration, dynamic combat, and a compelling narrative creates an experience that is both vast and intimate. The game's ambitious scope and detailed world-building ensure that players have endless opportunities for discovery and adventure. However, the complexity and scale of the game might be daunting for some players. The procedural generation, while impressive, can sometimes lead to a lack of cohesion in the game world. Additionally, the game's reliance on exploration and resource management might not appeal to all players. Overall, Starfield is a must-play for fans of Bethesda's RPGs and anyone interested in space exploration and science fiction. It sets a new standard for the genre, offering a rich and immersive experience that will captivate players for hours on end."
        },
        "avowed_review": {
            "image": "../assets/avowed.jpg",
            "title": "Avowed",
            "short_desc": "Obsidian Entertainment's New First-person RPG Set in the World of Eora",
            "author": "Rado Radev",
            "date_of_publish": "28/06/2024",
            "playtime_of_publish": "0h",
            "rating": "-",
            "genre": "RPG, Action, Adventure",
            "developer": "Obsidian Entertainment",
            "publisher": "Xbox Game Studios",
            "platform": "PC, XBox X and S series",
            "release_date": "2024",
            "game_introduction": "Avowed is an upcoming first-person RPG from Obsidian Entertainment, set in the fantastical world of Eora, known from the Pillars of Eternity series. Scheduled for release in 2024, Avowed aims to deliver an immersive experience filled with deep lore, engaging combat, and a richly detailed world. With Obsidian's track record of creating compelling RPGs, there's much anticipation and speculation about what Avowed could bring to the table.",
            "gameplay": "Avowed is expected to blend classic RPG elements with innovative gameplay mechanics. Speculations suggest a dynamic combat system that allows players to wield a variety of weapons and magical abilities. The game could feature deep customization options, letting players tailor their characters' skills, appearance, and playstyle to their liking. Exploration will likely play a significant role, with players navigating through vast, open environments. Eora's diverse landscapes, from lush forests to ancient ruins, could be filled with hidden secrets, quests, and lore. Interaction with NPCs and factions might offer meaningful choices that impact the story and the world around the player. Combat might incorporate both melee and ranged options, along with a robust magic system. The use of spells and enchantments could provide strategic depth, requiring players to adapt their tactics based on the enemies they face. Additionally, the game might include a crafting system for creating potions, weapons, and other useful items.",
            "story": "Set in the same universe as Pillars of Eternity, Avowed is expected to delve into the rich lore of Eora. The narrative could revolve around a grand conflict involving powerful factions and ancient forces. Players might assume the role of a protagonist caught in the midst of this turmoil, uncovering their own destiny while influencing the fate of the world. The story is likely to feature complex characters, each with their own motivations and backstories. Dialogue choices and moral decisions could shape relationships and determine the outcome of key events. As with previous Obsidian titles, expect a narrative filled with twists, moral ambiguity, and deep philosophical themes.",
            "final_thoughts": "Though still shrouded in mystery, Avowed holds the promise of being a standout RPG. Based on Obsidian's expertise and the glimpses we've seen so far, the game could offer a compelling blend of exploration, combat, and storytelling. Its setting in the world of Eora provides a rich backdrop for an epic adventure, potentially making it a must-play for RPG enthusiasts. Speculated strengths include a richly detailed world, a deep and engaging storyline, and a dynamic combat system. However, as with any highly anticipated game, there are potential pitfalls. Balancing complex systems and delivering a polished experience on release day will be crucial for Avowed to meet its lofty expectations. In conclusion, Avowed could be a defining entry in the RPG genre, offering a vast, immersive world filled with adventure and intrigue. If Obsidian lives up to the hype, players can look forward to a game that not only honors the legacy of Pillars of Eternity but also carves out its own unique place in the RPG landscape."
        },
        "forspoken_review": {
            "image": "../assets/forspoken.jpg",
            "title": "Forspoken",
            "short_desc": "A New Fantasy Adventure from the Creators of Final Fantasy XV",
            "author": "Rado Radev",
            "date_of_publish": "24/05/2024",
            "playtime_of_publish": "50h",
            "rating": "5/10",
            "genre": "RPG, Action, Adventure",
            "developer": "Luminous Productions",
            "publisher": "Square Enix",
            "platform": "PC, PS5",
            "release_date": "24/01/2023",
            "game_introduction": "Forspoken, developed by Luminous Productions and published by Square Enix, is an action RPG that takes players on a fantastical journey through the land of Athia. Released in January 2024, the game follows the story of Frey Holland, a young woman from New York who is transported to a magical world filled with danger and wonder. Forspoken combines fast-paced combat, parkour-inspired movement, and a captivating narrative to deliver a unique gaming experience.",
            "gameplay": "Forspoken features a dynamic and fluid combat system that emphasizes agility and magical abilities. Players control Frey, who wields a variety of elemental spells and combat techniques. The game's parkour mechanics allow for swift and graceful movement through the environment, making exploration and combat feel seamless and exhilarating. The open-world design of Athia encourages exploration, with diverse landscapes ranging from lush forests to arid deserts. Players can discover hidden treasures, complete side quests, and encounter various creatures and enemies. The game's crafting system allows players to create potions and upgrade their gear, enhancing their abilities and survivability. Combat in Forspoken is fast-paced and strategic. Players can combine different spells to create powerful attacks and utilize the environment to their advantage. The game's skill tree offers a range of upgrades and abilities, allowing players to tailor Frey's combat style to their preferences. The variety of spells and combat techniques ensures that combat remains engaging and challenging.",
            "story": "The narrative of Forspoken follows Frey Holland as she navigates the magical world of Athia. Struggling to survive in a land filled with mythical creatures and malevolent forces, Frey uncovers her own latent magical abilities. She must learn to harness these powers to fight against the oppressive rulers of Athia and uncover the truth behind her mysterious arrival. The story is rich with lore and character development. Frey's journey is one of self-discovery and empowerment, as she evolves from a reluctant hero to a powerful force capable of challenging the dark forces of Athia. The game features a diverse cast of characters, each with their own backstories and motivations, adding depth to the narrative. The story is delivered through cinematic cutscenes, in-game dialogue, and environmental storytelling. Players' choices and actions influence the outcome of the story, leading to multiple possible endings. The game's narrative is both epic and personal, exploring themes of identity, destiny, and the power of belief.",
            "final_thoughts": "Forspoken is a visually stunning and mechanically innovative RPG that offers a fresh take on the fantasy genre. The combination of fluid parkour movement, strategic combat, and a compelling narrative creates an engaging and immersive experience. The game's protagonist, Frey, is a relatable and dynamic character whose journey resonates with players. However, the game's fast-paced combat and complex mechanics might be overwhelming for some players. The open-world design, while beautiful, can sometimes feel empty, and the story's pacing may be uneven at times. Overall, Forspoken is a bold and ambitious title that offers a unique blend of action and fantasy. It's a must-play for fans of the genre and those looking for a new and exciting adventure."
        },
        "saints_row_review": {
            "image": "../assets/saints_row.jpg",
            "title": "Saints Row 5",
            "short_desc": "Back in a Reboot that Promises Wild Action and Humor",
            "author": "Rado Radev",
            "date_of_publish": "13/02/2024",
            "playtime_of_publish": "92h",
            "rating": "6.5/10",
            "genre": "RPG, Action",
            "developer": "Volition",
            "publisher": "Deep Silver",
            "platform": "PC, PS4, PS5, XBoxONE, XBox X and S series",
            "release_date": "23/08/2022",
            "game_introduction": "Saints Row V, developed by Volition and published by Deep Silver, is the latest installment in the over-the-top action-adventure series. Released in August 2023, the game serves as a reboot, promising wild action, humor, and a fresh take on the beloved franchise. Players once again take control of the leader of the Saints, navigating a world filled with chaos, crime, and mayhem.",
            "gameplay": "Saints Row V offers a sandbox experience, allowing players to explore a vibrant open world filled with activities, missions, and opportunities for mayhem. The game features a robust character creation system, enabling players to customize their boss with a wide range of options. The gameplay combines third-person shooting, driving, and melee combat, providing a variety of ways to wreak havoc. The game's world is divided into distinct districts, each with its own flavor and challenges. Players can engage in side missions, collectables, and activities such as car chases, heists, and gang battles. The game's humor and over-the-top action are evident in every aspect, from the outrageous weapons to the wild stunts players can perform. Co-op multiplayer is a significant feature, allowing players to team up with friends and cause chaos together. The game's cooperative play enhances the experience, adding a layer of fun and unpredictability. The inclusion of a robust arsenal of weapons and vehicles ensures that players have the tools they need to complete missions and explore the city.",
            "story": "The narrative of Saints Row V follows the rise of the Saints gang as they attempt to dominate the criminal underworld. The story is filled with humor, satire, and outrageous scenarios, staying true to the series' signature style. Players encounter a cast of eccentric characters, each contributing to the game's wild and entertaining plot. The story is delivered through cinematic cutscenes, in-game dialogue, and mission-based objectives. The game's narrative structure allows for a mix of linear and open-ended storytelling, providing players with a sense of freedom while keeping them engaged with the main plot. The choices players make can influence the outcome of certain missions, adding a layer of replayability. The humor and tone of the story are a standout feature, with the game embracing its absurdity and delivering a memorable and entertaining experience. The game's narrative explores themes of power, loyalty, and the pursuit of chaos, all wrapped in a comedic and satirical package.",
            "final_thoughts": "Saints Row V is a return to form for the series, delivering the wild action, humor, and open-world chaos that fans expect. The combination of diverse gameplay mechanics, robust customization, and a humorous narrative creates a fun and engaging experience. The game's cooperative multiplayer adds a social element, enhancing the overall enjoyment. However, the game's over-the-top nature and humor might not appeal to everyone. Some players might find the chaotic gameplay and outrageous scenarios too overwhelming or lacking in depth. Additionally, the game's reliance on satire and humor might not resonate with all audiences. Overall, Saints Row V is a blast for fans of the series and those looking for a fun and chaotic open-world adventure. It's a game that doesn't take itself too seriously, offering a wild and entertaining ride."
        },
        "dying_light_review": {
            "image": "../assets/dying_light_2.jpg",
            "title": "Dying Light 2",
            "short_desc": "A Post-apocalyptic World Filled with Zombies and Danger",
            "author": "Rado Radev",
            "date_of_publish": "02/01/2024",
            "playtime_of_publish": "70h",
            "rating": "8/10",
            "genre": "Action, Adventure, Horror",
            "developer": "Techland",
            "publisher": "Techland",
            "platform": "PC, PS4, PS5, Nintendo Switch, XBoxONE, XBox X and S series",
            "release_date": "04/02/2022",
            "game_introduction": "Dying Light 2 Stay Human, developed by Techland and released in February 2022, is an action RPG set in a post-apocalyptic world overrun by zombies. The game is a sequel to the acclaimed Dying Light, continuing the story of humanity's struggle for survival. Players navigate a vast open world, utilizing parkour and combat skills to survive and thrive in a world filled with danger and intrigue.",
            "gameplay": "Dying Light 2 Stay Human builds on the parkour and combat mechanics of its predecessor, offering fluid movement and intense action. Players control Aiden Caldwell, a wanderer with a mysterious past, who must navigate The City, one of the last human settlements. The game's open-world design encourages exploration, with numerous districts to discover, each with its own unique challenges and atmosphere. The game's day-night cycle significantly impacts gameplay, with the infected becoming more dangerous and aggressive at night. Players must balance their activities, planning their movements and strategies according to the time of day. The parkour system allows for seamless traversal of the environment, providing a sense of freedom and agility. Combat is visceral and dynamic, with a focus on melee weapons and improvised tools. Players can craft and upgrade their arsenal, using a variety of weapons and traps to take down enemies. The game also introduces a skill tree, allowing players to customize Aiden's abilities and playstyle. Stealth and tactical planning are essential, particularly during night-time encounters.",
            "story": "The narrative of Dying Light 2 Stay Human is a tale of survival, intrigue, and moral choices. Aiden's quest to uncover his past and find his sister drives the main plot, while the world's factions and characters provide a rich backdrop. The game's story is shaped by the player's decisions, with choices affecting the outcome of missions, relationships, and the fate of The City. The game's narrative explores themes of trust, betrayal, and the cost of survival. The characters are well-developed, each with their own motivations and story arcs. The story is delivered through cinematic cutscenes, in-game dialogue, and environmental storytelling, creating an immersive and engaging experience. The choices players make have significant consequences, impacting the world and its inhabitants. This branching narrative structure adds replayability, encouraging players to explore different paths and outcomes. The game's story is both personal and expansive, providing a deep and compelling experience.",
            "final_thoughts": "Dying Light 2 Stay Human is a thrilling and immersive action RPG that builds on the strengths of its predecessor. The combination of fluid parkour movement, intense combat, and a branching narrative creates a compelling and engaging experience. The game's open world is rich with detail, offering endless opportunities for exploration and adventure. However, the game's difficulty and intensity might be daunting for some players. The night-time gameplay, in particular, can be challenging and stressful. Additionally, the game's reliance on crafting and resource management might not appeal to everyone. Overall, Dying Light 2 Stay Human is a must-play for fans of the genre and those looking for a challenging and immersive post-apocalyptic adventure. Its blend of parkour, combat, and storytelling sets a high standard for action RPGs."
        },
        "sifu_review": {
            "image": "../assets/sifu.jpg",
            "title": "Sifu",
            "short_desc": "Master Kung Fu and Take on Your Enemies",
            "author": "Rado Radev",
            "date_of_publish": "03/03/2024",
            "playtime_of_publish": "35h",
            "rating": "7/10",
            "genre": "Action",
            "developer": "Sloclap",
            "publisher": "Sloclap",
            "platform": "PC, PS4, PS5, Nintendo Switch, XBoxONE, XBox X and S series",
            "release_date": "08/02/2022",
            "game_introduction": "Sifu, developed and published by Sloclap, is a gripping action game that immerses players in the world of martial arts. Known for its intense combat and unique aging mechanic, Sifu offers a fresh take on the beat 'em up genre. The game challenges players to master kung fu and seek vengeance against those who wronged them, delivering an experience that's both brutal and beautiful.",
            "gameplay": "Sifu's gameplay centers around fluid and precise martial arts combat. Players take on the role of a young kung fu student on a quest for revenge, facing off against numerous foes in intricate, hand-to-hand combat. The game's combat system is deep and rewarding, emphasizing timing, positioning, and a variety of attacks and counterattacks. A standout feature of Sifu is its innovative aging mechanic. Each time the player character dies, they age, becoming older and more experienced but also more fragile. This system adds a layer of strategy, as players must balance the wisdom and skill gained through aging with the physical decline that comes with it. The aging mechanic ensures that every encounter feels significant and that players must continually adapt their tactics. Level design in Sifu is both varied and intricate, with each environment offering unique challenges and opportunities. From bustling nightclubs to serene temples, the settings are crafted to enhance the combat experience. The game encourages exploration and experimentation, rewarding players who take the time to learn enemy patterns and environmental advantages.",
            "story": "Sifu tells a compelling tale of vengeance and redemption. The protagonist's journey is deeply personal, driven by a desire to avenge the death of their family. As players progress through the game, they uncover the backstory of each target, delving into a narrative filled with emotion and intensity. The story is conveyed through stylish cutscenes and environmental storytelling, immersing players in the protagonist's quest. Each enemy defeated and each new location explored adds depth to the narrative, creating a rich and engaging experience. The game's ending is influenced by the player's choices and actions, offering multiple outcomes based on how they approach their quest for revenge.",
            "final_thoughts": "Sifu is a standout title in the action genre, combining intricate martial arts combat with a unique aging mechanic to deliver a fresh and challenging experience. The game's emphasis on skill and strategy makes each encounter feel meaningful, while the compelling story drives players forward. Strengths of Sifu include its deep and rewarding combat system, innovative aging mechanic, and beautifully crafted environments. The game's narrative is also a highlight, providing a personal and engaging story of vengeance and redemption. However, the difficulty of Sifu might be a hurdle for some players. The game's demanding combat requires precision and patience, and the aging mechanic adds an additional layer of challenge. For those willing to embrace its difficulty, Sifu offers a profoundly satisfying experience. In conclusion, Sifu is a must-play for fans of action games and martial arts. Its unique mechanics, challenging combat, and compelling story make it a memorable and rewarding experience. Whether you're a seasoned fighter or new to the genre, Sifu promises an adventure that's both brutal and beautiful, testing your skills and resilience every step of the way."
        },
        "gran_turismo_review": {
            "image": "../assets/gran_turismo_7.jpg",
            "title": "Gran Turismo 7",
            "short_desc": "Get Behind the Wheel in the Latest Installment of this Iconic Racing Series",
            "author": "Rado Radev",
            "date_of_publish": "18/03/2024",
            "playtime_of_publish": "40h",
            "rating": "7/10",
            "genre": "Racing",
            "developer": "Polyphony Digital",
            "publisher": "Sony Interactive Entertainment",
            "platform": "PS5, PS4",
            "release_date": "04/03/2022",
            "game_introduction": "Gran Turismo 7, developed by Polyphony Digital and published by Sony Interactive Entertainment, is the latest installment in the iconic racing simulation series. Celebrated for its meticulous attention to detail, realistic driving physics, and extensive car collection, Gran Turismo 7 aims to deliver the most comprehensive and immersive racing experience to date.",
            "gameplay": "Gran Turismo 7 offers a robust and authentic driving experience that caters to both casual players and hardcore racing enthusiasts. The game features an impressive roster of over 400 cars, ranging from classic models to the latest supercars, all meticulously recreated to capture their real-world counterparts' look, feel, and performance. The game includes a wide variety of tracks, from real-world circuits like Nürburgring and Suzuka to original courses designed by Polyphony Digital. Each track is crafted with stunning detail, providing a realistic and immersive racing environment. The dynamic weather and time-of-day changes add another layer of realism, affecting track conditions and visibility. Gran Turismo 7's driving physics are top-notch, offering a realistic and responsive driving experience. The game supports a range of driving aids and customization options, allowing players to tailor the difficulty and realism to their preferences. Whether you're using a gamepad or a full racing wheel setup, Gran Turismo 7 provides a satisfying and challenging experience. The game also features a comprehensive single-player campaign, 'GT Mode,' where players can buy, upgrade, and customize their cars, participate in a variety of races and challenges, and progress through a detailed career mode. Additionally, the multiplayer mode offers competitive online racing with robust matchmaking and community features.",
            "story": "While Gran Turismo 7 doesn't follow a traditional narrative, its 'GT Mode' serves as a career mode that guides players through the world of professional racing. Players start with modest vehicles and work their way up to high-performance cars, participating in a wide range of events and championships. The progression system is engaging, rewarding players with new cars, parts, and customization options as they advance. The game also includes a “Music Rally” mode, which combines racing with dynamic soundtracks, adding a unique twist to the gameplay experience. This mode aims to provide a fun and relaxing way to enjoy racing while listening to curated music tracks.",
            "final_thoughts": "Gran Turismo 7 is a masterclass in racing simulation, offering an unparalleled level of detail, realism, and depth. The extensive car roster, meticulously designed tracks, and realistic driving physics make it a must-play for any racing enthusiast. Strengths of Gran Turismo 7 include its stunning graphics, comprehensive car collection, and immersive gameplay mechanics. The game's dynamic weather and time-of-day systems add to the realism, providing a constantly evolving racing experience. Additionally, the robust multiplayer mode ensures that players can enjoy competitive racing with friends and the broader community. However, the game's realistic driving physics might be challenging for newcomers, requiring patience and practice to master. Despite this, Gran Turismo 7 offers a range of customization options to help players ease into the experience. In conclusion, Gran Turismo 7 sets a new standard for racing simulations. Its attention to detail, realistic gameplay, and extensive content make it a standout title in the genre. Whether you're a seasoned racer or a newcomer, Gran Turismo 7 promises an exhilarating and immersive racing experience that's hard to beat."
        },
        "the_legend_of_zelda_review": {
            "image": "../assets/legend_of_zelda.jpg",
            "title": "The Legend of Zelda: Tears of the Kingdom",
            "short_desc": "The Highly Anticipated Sequel to One of the Greatest Games of All Time",
            "author": "Rado Radev",
            "date_of_publish": "20/01/2024",
            "playtime_of_publish": "150h",
            "rating": "9/10",
            "genre": "RPG, Action, Adventure",
            "developer": "Nintendo EPD",
            "publisher": "Nintendo",
            "platform": "Nintendo Switch",
            "release_date": "03/03/2017",
            "game_introduction": "The Legend of Zelda: Tears of the Kingdom, developed and published by Nintendo, is the highly anticipated sequel to the critically acclaimed Breath of the Wild. Building upon its predecessor's open-world exploration and innovative gameplay mechanics, Tears of the Kingdom aims to deliver an even more expansive and immersive experience in the beloved franchise.",
            "gameplay": "Tears of the Kingdom retains the open-world structure of Breath of the Wild, allowing players to explore the vast and diverse landscapes of Hyrule at their own pace. The game introduces new mechanics and features to enhance the exploration and combat experience. One of the significant additions is the ability to explore the skies above Hyrule, with floating islands and airborne challenges offering a new dimension to the game world. This verticality adds depth to the exploration, encouraging players to think creatively and use their environment to their advantage. The combat system has been refined, offering more fluid and dynamic encounters. Players can utilize a wide range of weapons, tools, and abilities to defeat enemies and solve puzzles. The game also introduces new abilities and mechanics, such as the power to manipulate time and gravity, providing fresh and innovative ways to interact with the world. Tears of the Kingdom also emphasizes crafting and resource management, with players collecting materials to upgrade their gear, cook food, and create useful items. The game encourages experimentation, rewarding players who explore and utilize the environment creatively.",
            "story": "Tears of the Kingdom continues the story of Link and Zelda as they face a new threat to Hyrule. The narrative delves deeper into the lore of the Zelda universe, uncovering ancient secrets and exploring the history of the kingdom. The story is rich and engaging, filled with memorable characters, epic quests, and emotional moments. Players will encounter a variety of allies and adversaries, each with their own unique backstories and motivations. The game's narrative is interwoven with its exploration and gameplay, creating a cohesive and immersive experience. The relationship between Link and Zelda is a central focus, with their bond evolving throughout the game. The story is told through a combination of cutscenes, in-game events, and environmental storytelling, ensuring that players are constantly engaged and invested in the unfolding drama.",
            "final_thoughts": "The Legend of Zelda: Tears of the Kingdom is a worthy successor to Breath of the Wild, expanding on its predecessor's strengths while introducing new and exciting elements. The game's vast open world, innovative gameplay mechanics, and compelling story make it a must-play for fans of the series and newcomers alike. Strengths of Tears of the Kingdom include its expansive and beautifully crafted world, refined combat system, and rich storytelling. The addition of sky exploration and new abilities adds fresh layers of depth and creativity to the gameplay. The game's focus on crafting and resource management also enhances the overall experience, encouraging players to explore and experiment. However, the game's vastness might be overwhelming for some players, and the new mechanics may require time to master. Despite this, Tears of the Kingdom offers an incredibly rewarding and immersive experience that is sure to captivate players. In conclusion, The Legend of Zelda: Tears of the Kingdom is a triumphant continuation of the franchise, delivering a rich and immersive adventure that pushes the boundaries of open-world gaming. Whether you're a longtime fan or a newcomer, this game promises an unforgettable journey through the enchanting world of Hyrule."
        }
    }
}